// --------------------------------------------------------------------------------------------------------------------
// <copyright file="DocumentCategory.cs" company="РусБИТех">
//   Copyright (c) 2014. All rights reserved.
// </copyright>
// <summary>
//   Категория документа, выгруженная для СМО(Документ УДЛ, Документ подтверждающий регистрацию, Документ разрешающий
//   проживание)
// </summary>
// --------------------------------------------------------------------------------------------------------------------

namespace rt.srz.model.HL7.enumerations
{
  /// <summary>
  ///   Категория документа, выгруженная для СМО(Документ УДЛ, Документ подтверждающий регистрацию, Документ разрешающий
  ///   проживание)
  /// </summary>
  public enum DocumentCategory
  {
    /// <summary>
    /// The unknown.
    /// </summary>
    Unknown = 0, 

    /// <summary>
    ///   Документ УДЛ
    /// </summary>
    Udl = 1, 

    /// <summary>
    ///   Документ подтверждающий регистрацию
    /// </summary>
    Registration = 2, 

    /// <summary>
    ///   Документ разрешающий проживание
    /// </summary>
    Residency = 3
  }
}